[
    {
        "mainText": "An Israeli startup has sued Apple Inc, accusing the iPhone maker of copying its patented smartphone camera technology for the iPhone 7 Plus and the iPhone 8 Plus .",
        "redirectionUrl": "http://vartaa.in/",
        "titleText": "Apple infringed our dual camera tech patent for iPhone 7 Plus, 8 Plus: Israeli start-up",
        "uid": "9451f360925b56429432a505ee793ddc",
        "updateDate": "2017-11-08"
    },
    {
        "mainText": "The class 11 student is the prime suspect in the murder case.",
        "redirectionUrl": "http://vartaa.in/",
        "titleText": "Pradyuman murder LIVE updates: CBI gets 3-day remand of accused Class 11 Ryan school student",
        "uid": "5cf1bea5f6c4052aff0fa21d8e56b954",
        "updateDate": "2017-11-08"
    },
    {
        "mainText": "&lsquo;Employees Required&rsquo; signboards outside garment-making units in Tirupur have been replaced by &lsquo;To Let&rsquo; signs, such has been the impact of demonetisation on the town&rsquo;s textile industry",
        "redirectionUrl": "http://vartaa.in/",
        "titleText": "Textile hub Tirupur still reeling from demonetisation blow",
        "uid": "6a91e5daf8678ccab3bf28ee2614777c",
        "updateDate": "2017-11-08"
    },
    {
        "mainText": "India&rsquo;s central bank is headed for a collision with some of the country&rsquo;s largest companies, as it steps up pressure on banks to clean up a chronic bad-debt problem weighing on the country&rsquo;s economic growth.",
        "redirectionUrl": "http://vartaa.in/",
        "titleText": "RBI Orders India&#39;s Banks to Act on Big Companies&#39; Bad Debt",
        "uid": "39d77b77e559ba49dc0e6acf7c8b5eeb",
        "updateDate": "2017-11-08"
    },
    {
        "mainText": "The raging controversy over IndiGo ground staffers dragging and manhandling a passenger at Delhi Airport last month took a new turn on Wednesday with the airline telling the government that the sacked &quot;whistleblower&quot; employee had &quot;instigated&quot; the entire episode.",
        "redirectionUrl": "http://vartaa.in/",
        "titleText": "Sacked employee &#39;instigated&#39; manhandling of passenger at Delhi Airport, IndiGo tells government",
        "uid": "63cf5c65082e3fcac456eb6dd9e39f20",
        "updateDate": "2017-11-08"
    },
    {
        "mainText": "The next frontier for the&nbsp;great Indian e-commerce battle could be shampoos, cereals, fruits, and vegetables. Despite a&nbsp;failed attempt two years ago, India&#39;s largest homegrown e-commerce major, Flipkart, is once again experimenting with&nbsp;online grocery retail with a service called Supermart. The company is currently running Supermart in a&nbsp;pilot stage for its employees in Bengaluru.&nbsp;&quot;We intend to...",
        "redirectionUrl": "http://vartaa.in/",
        "titleText": "Online groceries is a tough nut to crack. So why are India&rsquo;s e-commerce giants obsessed with it?",
        "uid": "a6d5fe6a404a76eb6afc25fa21b0bdd4",
        "updateDate": "2017-11-08"
    }
]
